---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsEndNotchOption.Custom
enum: Autodesk.Revit.DB.Architecture.StairsEndNotchOption
source: html/d0586a61-e38c-2a6b-f544-4ffdb7e91d8f.htm
---
# Autodesk.Revit.DB.Architecture.StairsEndNotchOption.Custom

The notch width is customized by user.